app/helpers/cities_helper.rb

SELECT COUNT(*) FROM "states"
---
  def states
    State.all if State.count.positive?