app/controllers/cities_controller.rb

  def index
    @cities = City.all.paginate(page: params[:page]).ordered_by_name
---
SELECT "cities".* FROM "cities" ORDER BY "cities"."name" ASC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "cities"

  def create
    @city = City.new(city_params)
    respond_to do |format|
      if @city.save
---
INSERT INTO "cities" ("name", "states_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Porto Alegre"], ["states_id", 4], ["created_at", "2024-01-30 18:02:13.790241"], ["updated_at", "2024-01-30 18:02:13.790241"]]

  def destroy
    @city.destroy
---
DELETE FROM "cities" WHERE "cities"."id" = $1  [["id", 1]]

  def search
    @cities = if city_params.present?
                City.filter(city_params).paginate(page: params[:page]).ordered_by_name
---
SELECT "cities".* FROM "cities" WHERE (name like '%jur%' or name like 'jur%' or name like '%jur') ORDER BY "cities"."name" ASC LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "cities"