app/controllers/states_controller.rb

  def index
    @states = State.all
---
SELECT "states".* FROM "states"

  def create
    @state = State.new(state_params)

    respond_to do |format|
      if @state.save
---
INSERT INTO "states" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Paraná"], ["created_at", "2024-02-15 15:20:10.654957"], ["updated_at", "2024-02-15 15:20:10.654957"]]

  def destroy
    @state.destroy
---
DELETE FROM "states" WHERE "states"."id" = $1  [["id", 1]]

  def set_state
    @state = State.find(params[:id])
---
SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]