app/views/cities/index.html.erb

SELECT "states".* FROM "states"
---
      <%= city_fields.label :name, "Buscar por:" %>
      <%= city_fields.collection_select(:states_id,State.all, :id, :name, prompt: true) %>