app/models/city.rb

SELECT "states".* FROM "states"
---
  def states
    @states = State.all

SELECT "states".* FROM "states" WHERE "states"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def state
    State.find(self.states_id).name